{
  "auto_mapping": null,
  "base_model_name_or_path": "Langboat/bloom-1b4-zh",
  "encoder_dropout": 0.1,
  "encoder_hidden_size": 1024,
  "encoder_num_layers": 5,
  "encoder_reparameterization_type": "MLP",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 10,
  "peft_type": "P_TUNING",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 2048
}