{
  "alpha": 8,
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "bigscience/bloom-1b1",
  "inference_mode": true,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "module_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LOHA",
  "r": 8,
  "rank_dropout": 0.0,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query_key_value"
  ],
  "task_type": "CAUSAL_LM",
  "use_effective_conv2d": false
}