{
  "auto_mapping": null,
  "base_model_name_or_path": "bigscience/bloom-1b1",
  "encoder_hidden_size": 1536,
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 10,
  "peft_type": "PREFIX_TUNING",
  "prefix_projection": true,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1536
}